Revit 2027 API
ParameterTypeId.RvtLinkFileNameWithoutExt Property
 "File Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RvtLinkFileNameWithoutExt { get; }
Public Shared ReadOnly Property RvtLinkFileNameWithoutExt As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RvtLinkFileNameWithoutExt {
	ForgeTypeId^ get ();
}
static member RvtLinkFileNameWithoutExt : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace